; domain
(define (domain GROCERY)
    (:requirements :strips :typing :adl)
    (:types item)
    (:predicates (on ?x - item ?y - item)
                 (inbox ?x - item)
                 (inclutter ?x - item)
                 (beside ?x - item ?y - item)
                 (handempty)
                 (holding ?x - item)
                 (topfree ?x - item)
                 (boxfull)
                 )
                 
    
    (:action pick-from-clutter
            :parameters (?x - item)
            :precondition (and (topfree ?x) (handempty) (inclutter ?x))
            :effect
            (and (holding ?x)
                (not (handempty))
                (not (inbox ?x))
                (not (inclutter ?x))
                (not (topfree ?x)))
    )
    
    (:action pick-from-box
            :parameters (?x - item)
            :precondition (and (topfree ?x) (handempty) (inbox ?x))
            :effect
            (and (holding ?x)
                (not (boxfull))
                (not (handempty))
                (not (inbox ?x))
                (not (inclutter ?x))
                (not (topfree ?x)))
    )
    
    (:action pick-from
            :parameters (?x - item ?y - item)
            :precondition (and (on ?x ?y) (topfree ?x) (handempty))
            :effect
            (and (holding ?x)
                (not (handempty))
                (not (inbox ?x))
                (not (inclutter ?x))
                (not (topfree ?x))
                (topfree ?y))
    )
    
    (:action put-in-clutter
            :parameters (?x - item)
            :precondition (holding ?x)
            :effect
            (and (not (holding ?x))
                (handempty)
                (inclutter ?x)
                (topfree ?x))
    )
    
    (:action put-in-box
            :parameters (?x - item)
            :precondition  (and (holding ?x) (not (boxfull)))
            :effect
            (and (not (holding ?x))
                (handempty)
                (inbox ?x)
                (topfree ?x))
    )
    
    (:action put-on 
            :parameters (?x - item ?y - item)
            :precondition (and (holding ?x) (topfree ?y) )
            :effect
            (and (not (holding ?x))
                (on ?x ?y)
                (handempty)
                (topfree ?x)
                (not (topfree ?y)))
    )
)

; problem
(define (problem PACKED-GROCERY) 
(:domain GROCERY) 
 (:objects h3 m5 m4 m3 m1 h5 h2 h1 m0 h0 m2 h4 - item)
(:init (handempty) (inbox m0) (on m5 m0) (inbox m1) (topfree m1) (inbox m2) (topfree m2) (topfree m3) (inclutter m3) (topfree h0) (inclutter h0) (topfree h1) (inclutter h1) (topfree h2) (inclutter h2) (topfree m4) (inclutter m4) (topfree h3) (inclutter h3) (topfree h4) (inclutter h4) (topfree m5) (inclutter m5) (topfree h5) (inclutter h5) (boxfull))
(:goal (and (inbox h0) (inbox h1) (inbox h2) (inbox h3) (inbox h4) (inbox h5)  (and (or (on m0 h0) (on m0 h1) (on m0 h2) (on m0 h3) (on m0 h4) (on m0 h5) ) (or (on m1 h0) (on m1 h1) (on m1 h2) (on m1 h3) (on m1 h4) (on m1 h5) ) (or (on m2 h0) (on m2 h1) (on m2 h2) (on m2 h3) (on m2 h4) (on m2 h5) ) (or (on m3 h0) (on m3 h1) (on m3 h2) (on m3 h3) (on m3 h4) (on m3 h5) ) (or (on m4 h0) (on m4 h1) (on m4 h2) (on m4 h3) (on m4 h4) (on m4 h5) ) (or (on m5 h0) (on m5 h1) (on m5 h2) (on m5 h3) (on m5 h4) (on m5 h5) ) ))))

; plan
1. (pick-from-box m1)
   deleted: (boxfull) (handempty) (inbox m1) (topfree m1)
   added: (holding m1)
   goals met: 0 of 7
2. (put-on m1 h0)
   deleted: (holding m1) (topfree h0)
   added: (on m1 h0) (handempty) (topfree m1)
   goals met: 0 of 7
3. (pick-from-clutter h1)
   deleted: (handempty) (inclutter h1) (topfree h1)
   added: (holding h1)
   goals met: 0 of 7
4. (put-in-box h1)
   deleted: (holding h1)
   added: (handempty) (inbox h1) (topfree h1)
   goals met: 1 of 7
5. (pick-from-clutter h2)
   deleted: (handempty) (inclutter h2) (topfree h2)
   added: (holding h2)
   goals met: 1 of 7
6. (put-in-box h2)
   deleted: (holding h2)
   added: (handempty) (inbox h2) (topfree h2)
   goals met: 2 of 7
7. (pick-from-clutter h3)
   deleted: (handempty) (inclutter h3) (topfree h3)
   added: (holding h3)
   goals met: 2 of 7
8. (put-in-box h3)
   deleted: (holding h3)
   added: (handempty) (inbox h3) (topfree h3)
   goals met: 3 of 7
9. (pick-from-clutter h4)
   deleted: (handempty) (inclutter h4) (topfree h4)
   added: (holding h4)
   goals met: 3 of 7
10. (put-in-box h4)
   deleted: (holding h4)
   added: (handempty) (inbox h4) (topfree h4)
   goals met: 4 of 7
11. (pick-from-clutter h5)
   deleted: (handempty) (inclutter h5) (topfree h5)
   added: (holding h5)
   goals met: 4 of 7
12. (put-in-box h5)
   deleted: (holding h5)
   added: (handempty) (inbox h5) (topfree h5)
   goals met: 5 of 7
13. (pick-from-clutter m3)
   deleted: (handempty) (inclutter m3) (topfree m3)
   added: (holding m3)
   goals met: 5 of 7
14. (put-on m3 h1)
   deleted: (holding m3) (topfree h1)
   added: (on m3 h1) (handempty) (topfree m3)
   goals met: 5 of 7
15. (pick-from-clutter m4)
   deleted: (handempty) (inclutter m4) (topfree m4)
   added: (holding m4)
   goals met: 5 of 7
16. (put-on m4 h2)
   deleted: (holding m4) (topfree h2)
   added: (on m4 h2) (handempty) (topfree m4)
   goals met: 5 of 7
17. (pick-from-box m2)
   deleted: (handempty) (inbox m2) (topfree m2)
   added: (holding m2)
   goals met: 5 of 7
18. (put-on m2 h3)
   deleted: (holding m2) (topfree h3)
   added: (on m2 h3) (handempty) (topfree m2)
   goals met: 5 of 7
19. (pick-from m5 m0)
   deleted: (handempty) (inclutter m5) (topfree m5)
   added: (holding m5) (topfree m0)
   goals met: 5 of 7
20. (put-on m5 h4)
   deleted: (holding m5) (topfree h4)
   added: (on m5 h4) (handempty) (topfree m5)
   goals met: 5 of 7
21. (pick-from-box m0)
   deleted: (handempty) (inbox m0) (topfree m0)
   added: (holding m0)
   goals met: 5 of 7
22. (put-on m0 h5)
   deleted: (holding m0) (topfree h5)
   added: (on m0 h5) (handempty) (topfree m0)
   goals met: 6 of 7
23. (pick-from m1 h0)
   deleted: (handempty) (topfree m1)
   added: (holding m1) (topfree h0)
   goals met: 6 of 7
24. (put-in-box m1)
   deleted: (holding m1)
   added: (handempty) (inbox m1) (topfree m1)
   goals met: 6 of 7
25. (pick-from-clutter h0)
   deleted: (handempty) (inclutter h0) (topfree h0)
   added: (holding h0)
   goals met: 6 of 7
26. (put-in-box h0)
   deleted: (holding h0)
   added: (handempty) (inbox h0) (topfree h0)
   goals met: 7 of 7
